// Generated by jextract

package io.github.mzmine.modules.io.import_rawdata_waters.api;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang = c:
 * struct ScanInfo {
 *     int32_t msLevel;
 *     int32_t polarity;
 *     int32_t driftScanCount;
 *     float precursorMz;
 *     float quadIsolationStart;
 *     float quadIsolationEnd;
 *     float collisionEnergy;
 *     float rt;
 * }
 *}
 */
public class ScanInfo {

  private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
          MassLynxLib.C_INT.withName("msLevel"), MassLynxLib.C_INT.withName("polarity"),
          MassLynxLib.C_INT.withName("driftScanCount"), MassLynxLib.C_FLOAT.withName("precursorMz"),
          MassLynxLib.C_FLOAT.withName("quadIsolationStart"),
          MassLynxLib.C_FLOAT.withName("quadIsolationEnd"),
          MassLynxLib.C_FLOAT.withName("collisionEnergy"), MassLynxLib.C_FLOAT.withName("rt"))
      .withName("ScanInfo");
  private static final OfInt msLevel$LAYOUT = (OfInt) $LAYOUT.select(groupElement("msLevel"));
  private static final long msLevel$OFFSET = 0;
  private static final OfInt polarity$LAYOUT = (OfInt) $LAYOUT.select(groupElement("polarity"));
  private static final long polarity$OFFSET = 4;
  private static final OfInt driftScanCount$LAYOUT = (OfInt) $LAYOUT.select(
      groupElement("driftScanCount"));
  private static final long driftScanCount$OFFSET = 8;
  private static final OfFloat precursorMz$LAYOUT = (OfFloat) $LAYOUT.select(
      groupElement("precursorMz"));
  private static final long precursorMz$OFFSET = 12;
  private static final OfFloat quadIsolationStart$LAYOUT = (OfFloat) $LAYOUT.select(
      groupElement("quadIsolationStart"));
  private static final long quadIsolationStart$OFFSET = 16;
  private static final OfFloat quadIsolationEnd$LAYOUT = (OfFloat) $LAYOUT.select(
      groupElement("quadIsolationEnd"));
  private static final long quadIsolationEnd$OFFSET = 20;
  private static final OfFloat collisionEnergy$LAYOUT = (OfFloat) $LAYOUT.select(
      groupElement("collisionEnergy"));
  private static final long collisionEnergy$OFFSET = 24;
  private static final OfFloat rt$LAYOUT = (OfFloat) $LAYOUT.select(groupElement("rt"));
  private static final long rt$OFFSET = 28;

  ScanInfo() {
    // Should not be called directly
  }

  /**
   * The layout of this struct
   */
  public static final GroupLayout layout() {
    return $LAYOUT;
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * int32_t msLevel
   *}
   */
  public static final OfInt msLevel$layout() {
    return msLevel$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * int32_t msLevel
   *}
   */
  public static final long msLevel$offset() {
    return msLevel$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * int32_t msLevel
   *}
   */
  public static int msLevel(MemorySegment struct) {
    return struct.get(msLevel$LAYOUT, msLevel$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * int32_t msLevel
   *}
   */
  public static void msLevel(MemorySegment struct, int fieldValue) {
    struct.set(msLevel$LAYOUT, msLevel$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * int32_t polarity
   *}
   */
  public static final OfInt polarity$layout() {
    return polarity$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * int32_t polarity
   *}
   */
  public static final long polarity$offset() {
    return polarity$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * int32_t polarity
   *}
   */
  public static int polarity(MemorySegment struct) {
    return struct.get(polarity$LAYOUT, polarity$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * int32_t polarity
   *}
   */
  public static void polarity(MemorySegment struct, int fieldValue) {
    struct.set(polarity$LAYOUT, polarity$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * int32_t driftScanCount
   *}
   */
  public static final OfInt driftScanCount$layout() {
    return driftScanCount$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * int32_t driftScanCount
   *}
   */
  public static final long driftScanCount$offset() {
    return driftScanCount$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * int32_t driftScanCount
   *}
   */
  public static int driftScanCount(MemorySegment struct) {
    return struct.get(driftScanCount$LAYOUT, driftScanCount$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * int32_t driftScanCount
   *}
   */
  public static void driftScanCount(MemorySegment struct, int fieldValue) {
    struct.set(driftScanCount$LAYOUT, driftScanCount$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * float precursorMz
   *}
   */
  public static final OfFloat precursorMz$layout() {
    return precursorMz$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * float precursorMz
   *}
   */
  public static final long precursorMz$offset() {
    return precursorMz$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * float precursorMz
   *}
   */
  public static float precursorMz(MemorySegment struct) {
    return struct.get(precursorMz$LAYOUT, precursorMz$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * float precursorMz
   *}
   */
  public static void precursorMz(MemorySegment struct, float fieldValue) {
    struct.set(precursorMz$LAYOUT, precursorMz$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * float quadIsolationStart
   *}
   */
  public static final OfFloat quadIsolationStart$layout() {
    return quadIsolationStart$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * float quadIsolationStart
   *}
   */
  public static final long quadIsolationStart$offset() {
    return quadIsolationStart$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * float quadIsolationStart
   *}
   */
  public static float quadIsolationStart(MemorySegment struct) {
    return struct.get(quadIsolationStart$LAYOUT, quadIsolationStart$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * float quadIsolationStart
   *}
   */
  public static void quadIsolationStart(MemorySegment struct, float fieldValue) {
    struct.set(quadIsolationStart$LAYOUT, quadIsolationStart$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * float quadIsolationEnd
   *}
   */
  public static final OfFloat quadIsolationEnd$layout() {
    return quadIsolationEnd$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * float quadIsolationEnd
   *}
   */
  public static final long quadIsolationEnd$offset() {
    return quadIsolationEnd$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * float quadIsolationEnd
   *}
   */
  public static float quadIsolationEnd(MemorySegment struct) {
    return struct.get(quadIsolationEnd$LAYOUT, quadIsolationEnd$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * float quadIsolationEnd
   *}
   */
  public static void quadIsolationEnd(MemorySegment struct, float fieldValue) {
    struct.set(quadIsolationEnd$LAYOUT, quadIsolationEnd$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * float collisionEnergy
   *}
   */
  public static final OfFloat collisionEnergy$layout() {
    return collisionEnergy$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * float collisionEnergy
   *}
   */
  public static final long collisionEnergy$offset() {
    return collisionEnergy$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * float collisionEnergy
   *}
   */
  public static float collisionEnergy(MemorySegment struct) {
    return struct.get(collisionEnergy$LAYOUT, collisionEnergy$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * float collisionEnergy
   *}
   */
  public static void collisionEnergy(MemorySegment struct, float fieldValue) {
    struct.set(collisionEnergy$LAYOUT, collisionEnergy$OFFSET, fieldValue);
  }

  /**
   * Layout for field:
   * {@snippet lang = c:
   * float rt
   *}
   */
  public static final OfFloat rt$layout() {
    return rt$LAYOUT;
  }

  /**
   * Offset for field:
   * {@snippet lang = c:
   * float rt
   *}
   */
  public static final long rt$offset() {
    return rt$OFFSET;
  }

  /**
   * Getter for field:
   * {@snippet lang = c:
   * float rt
   *}
   */
  public static float rt(MemorySegment struct) {
    return struct.get(rt$LAYOUT, rt$OFFSET);
  }

  /**
   * Setter for field:
   * {@snippet lang = c:
   * float rt
   *}
   */
  public static void rt(MemorySegment struct, float fieldValue) {
    struct.set(rt$LAYOUT, rt$OFFSET, fieldValue);
  }

  /**
   * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}. The
   * returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
   */
  public static MemorySegment asSlice(MemorySegment array, long index) {
    return array.asSlice(layout().byteSize() * index);
  }

  /**
   * The size (in bytes) of this struct
   */
  public static long sizeof() {
    return layout().byteSize();
  }

  /**
   * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
   */
  public static MemorySegment allocate(SegmentAllocator allocator) {
    return allocator.allocate(layout());
  }

  /**
   * Allocate an array of size {@code elementCount} using {@code allocator}. The returned segment
   * has size {@code elementCount * layout().byteSize()}.
   */
  public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
    return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
  }

  /**
   * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any). The
   * returned segment has size {@code layout().byteSize()}
   */
  public static MemorySegment reinterpret(MemorySegment addr, Arena arena,
      Consumer<MemorySegment> cleanup) {
    return reinterpret(addr, 1, arena, cleanup);
  }

  /**
   * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any). The
   * returned segment has size {@code elementCount * layout().byteSize()}
   */
  public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena,
      Consumer<MemorySegment> cleanup) {
    return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
  }
}

